[{"date":"2012-10-25","dream":"Im sitting on a couch watching a movie. Ben is to my left I think Chris maybe to my right. In the middle of the movie Ben adjust positions as if to lay down and when he does I notice that 3 mountain lions have come into the room. One of them jumps up onto the couch and acts like a normal cat but their fur isnt soft, its rough. I am slightly afraid if them going wild and apeshit at any second but I know I know I cant make a move so as not to startle them. It crosses me and goes over to the other couch where a woman is sitting I think its carol and she says is it a mountain lion? I wake up with Kate"},{"date":"2012-10-25","dream":"In Alabama me and my friends decide to goto the zoo one night. We are checking out all kinds o things playing around outside this one ate. I guess we let it open and the horses escape. We run cause we dont wanna get caught. I am running fast trying to make sure I grabbed all my stuff, a girl is behind me. I make it out and look back and see there is this triceratops like creature next to this car. We must have let that out too Shit. Im thinking in my head if we are gonna get caught. I make it to the van with someone chasing me. Like an alien lizard car and the. I notice Chris is driving it. It says teenage mutant Ninja turtles on the side. Everyone is still having fun running around. There are lots of other people at the park too. I am driving around being wary of the fact that the van seems a bit rocky and maybe the shocks are fucked. And the cigarette Im s point drops in my seat and I get it hoping it doesnt burn a hole cause maw as would be upset. Im looking to get everyone and I see these two girls. They say something to me infant remember."},{"date":"2012-10-28","dream":"So Im leaving someplace I dont remember where and I go to this like KFC across be street. Guess whos there. Rebecca. I sit down and talk to her shes happy to see me. I order some food, but they give me the wrong thing, but on purpose cause thy were out I chicken I guess so they give m duck. I ask for fries as well but they say they are out but then this cute little African girl comes and gives me a big bag. I thank her. "}]
