[{"date":"2012-10-25","dream":"It starts when I am at this house my dads across the street from the house outside looking into watching two girls. They are outside his house. I am looking into my dads as well and smiling. Hes with a guy and we are all communicating the Hotness of the chicks. Then the girls come over especially the one blonde. Shes kinda crazy and is all over me. She wants to have sex it seems. Im like who just barges In and starts doing this? I think I do start messing around with her and then she wants totals a shower cause I think Gian just got out. She had never taken a shower with someone before. She hops in the tub, its big and there is a shower next to it. I tell her friend who laughs and we go in there communicating amused by the ordeal, secretly I want her to Join in on it. I think we get her out and they leave. But then Dont forget dream with Chris and the Xbox and him just gotten out of jail He says he just got out of jail for graffitiing. Nice! I think I ask him what but I dont remember what it was. I think he said he just painted something black. Its nice to see him with this girl even though she may be a bad influence, if hes having fun thats good Im in a bus and Alex is on there. He has gotten a haircut. I had seen him earlier from afar but didnt recognize him. Dont remember the conversation but he seemed stoked about his haircut"},{"date":"2012-10-25","dream":"Im sitting on a couch watching a movie. Ben is to my left I think Chris maybe to my right. In the middle of the movie Ben adjust positions as if to lay down and when he does I notice that 3 mountain lions have come into the room. One of them jumps up onto the couch and acts like a normal cat but their fur isnt soft, its rough. I am slightly afraid if them going wild and apeshit at any second but I know I know I cant make a move so as not to startle them. It crosses me and goes over to the other couch where a woman is sitting I think its carol and she says is it a mountain lion? I wake up with Kate"},{"date":"2012-10-25","dream":"In Alabama me and my friends decide to goto the zoo one night. We are checking out all kinds o things playing around outside this one ate. I guess we let it open and the horses escape. We run cause we dont wanna get caught. I am running fast trying to make sure I grabbed all my stuff, a girl is behind me. I make it out and look back and see there is this triceratops like creature next to this car. We must have let that out too Shit. Im thinking in my head if we are gonna get caught. I make it to the van with someone chasing me. Like an alien lizard car and the. I notice Chris is driving it. It says teenage mutant Ninja turtles on the side. Everyone is still having fun running around. There are lots of other people at the park too. I am driving around being wary of the fact that the van seems a bit rocky and maybe the shocks are fucked. And the cigarette Im s point drops in my seat and I get it hoping it doesnt burn a hole cause maw as would be upset. Im looking to get everyone and I see these two girls. They say something to me infant remember."},{"date":"2012-10-28","dream":"So Im leaving someplace I dont remember where and I go to this like KFC across be street. Guess whos there. Rebecca. I sit down and talk to her shes happy to see me. I order some food, but they give me the wrong thing, but on purpose cause thy were out I chicken I guess so they give m duck. I ask for fries as well but they say they are out but then this cute little African girl comes and gives me a big bag. I thank her. "},{"date":"2012-10-28","dream":"I remember Im at a house with my mom to the left of me, then my dad then jon then michelle. There is this battle happening between my dad and I with him telling me practically how much he loves them and not me. Its really weird. He keeps throwing things at me, i think the first think i said was did you work today or something like that cause he said he was tired. He took it really personal. Then he was like ya i did i didnt make pizzas all day or something. Abd i was like ya i did stand on my feet all day. Then he tried to come at me with something else and I hit that away. it went on like that is for a bit, he did this weird thing where he like made this loving gesture around him and jon and michelle. I thought of giving a gesture to god. he went to bed then i try to set up my drum machine. Im pissed and wanna make music. I sing this song with the last word, like and slash his ass he wakes up with michelle and some other girl in the living room, i feel like a little sister. i say o sorry is it late, its like 930 isnt it. Hes like no its 1030 or something and i play stupid and he goes away, and then i give smirk to the little girl. and go back to my room to play with my drum machine"},{"date":"2012-10-29","dream":"Nicks and LindseyI have found myself in Austin after an adventure. I am with lindsey. She tells me or I found out thatcher and Matt. Rome up which is a shock cause she was dating nick. So shes single. Thats nice to hear cause I have always loved her. Shes happy to see me and happy I came to visit. Nick shows up. They are very friendly and seem give on good terms thats nice. We are in a backyard of sorts."},{"date":"2012-10-29","dream":"I have a dream I am kinda with Bruce Wayne I feel. I am watching this guy come into this house all beat up telling the people who live there he got beat up by a bat or something. then at the front door comes bruce wayne ringing a black trash at wanting to talk with the kid. They lady refuses and I and Bruce start talking about why the criminals are t returning to the boss but home instead hiding. I say cause he will kill them or punish them. We are walking to a house. I see my. Ike on the porch but when I get there its gone. I go to the kids house who usually steals it and he tells me where it. Is. But I shouldnt go there. Shit...I grab the bike that was there and its Lukes. It needs air so I get a ways from the neighborhood at pearl and thomas something street. I hear Luke say that if u touch Thomas street its a curse. And I say that breaks the double pedal blessing, crossing then crossing again...the streets are weird. Its like pearl crosses pearl and the Thomas one is the sidewalk. I hear Luke say At the end that he had to transfer that dream into a body cause it showed up in soul form at first"},{"date":"2012-11-06","dream":"Underneath the ground with Tia and Tristan. We escape into this tunnel placE. There are Zombie like people under there. Fighting with shards of ass. We fight to protect ourselves, amazed they wont die. I feel cut up all over. Thoughts jammed with glass but still they keep on. They smile when they dont die. What is going on? Back at Basta Kenzi is there. Im stoked to see her. She is at the kitchen door and sees me and tells me she doesnt like my hair. Saying it’s too much like hers. What a bitch. In the back something is going on, cant really remember. Huge leak downstairs in the house. Big flood cause of washer."},{"date":"2012-11-27","dream":"I got to this house with someone Im not sure who maybe Ben. There is this guy that lives there who welcomes us with open arms. He asks us if we want anything at all. At first I dont know but then ask him for apple juice, he says hell go find some. He vibe is strange, kinda like they had been waiting for us. I notice in the kitchen the guy is now trying to make apple juice from scratch. Its not working so I give him a hand and switch some parts in the machine. Its complicated and Im not sure if we ever got it to work. I got to the floor and notice my stuff is on the ground, my ids and stuff like that from my pocket. Next Im watching this show on like show time about Im not sure what. Its not reality tv but has a vibe like that, just a day in the life of this guy."},{"date":"2012-12-07","dream":"I go to this theme, park like six flags. Im with some friends i think. Its closed so we shouldnt be there, but we are :) I go back to the entrance for some reason and notice a guy there. He seems a little creepy, and i try to avoid him. I hide in different places to get a way but this doesnt work. he finds me, curious as to why Im hiding. I act like a child wanting to go to the water. i think i end up getting in a car with him and notice ether are lots of cars outside. H is a huge gathering of people and everyone seems to know everyone. They are all just arriving for what i dont know. I get in a truck with a couple of them and we head the opposite way than the park and i ask where we are going, they say we are playing a game. I look behind and notice no one is following, someone mentions we are winging. I notice a sign that pops up on the right, pointing to naropa cemetery. WE go in. I get the feeling it is a place where all of our graves are, yet i cant see if our death dates are on there. I thought it might be interesting to know, and there is this creepy vibe too. There are some kids in there too, we exchange glances i Ive them a quick glance. Next i go into this comic book store, with grant morrison. The lady working there i can hear talking to him, he must know her. She has left a book out for him, thinking he wanted it since he looked at it last time. Hes not that interested but I am, There is a weird pattern around the door, that allows people to transport to and from this place. very magical. But the time i want to leave it wont work for me. It had had before but wont this time.Im at a school, where there is a flying lotus show. It just got over and i go up and talk to him. I praise him for a bit, but i dont get much reaction, though he is attentive. And then i ask how he does it, and if he had some tips. He gets excited that i want to learn, and i tell him i have been trying. He tells me something about the levels, of the music, that it has to be turned up on the preamp first. i didnt quite get it and asked him what he meant. We are now asking outside, i think we are in denver. He says he just wants to edit or wants me to edit i feel. Then he takes off running, like a dog trying to catch a squirrel but its actually a bird. It’s so funny. Then i have to hurry up to catch up with him. I ask him what his plans are for the night, He says hes goin out in denver and what bout me? I tell him i have class at 9 that i need to go to, he respects that and i think it ends."},{"date":"2012-12-13","dream":"I have this great idea to kill Brian with an axe. I dont know why. But i come up to him while he is talking to this guy. Not sure if he is harassing him or not, but I hit him in the head with the axe. It doesnt kill but pisses him off, so he tries to fight me a bit with whatever he has. I then am able to take some more wacks at him. I think i want some other people to join in or am trying to impress them or something. I think later in the dream i do it to someone else, cant remember who this person is supposed to be. perhaps I am am now an axe murderer. At the end I am terribly worried that i did this. How could i have. Tons of guilt. I cant believe i did i. I couldnt control my self. O NO! But then i wake up simultaneously realizing its a dream, thinking o ya thats a dream, you didnt do that, what a relief"},{"date":"2013-01-16","dream":"Me and this group of people are running around. From what I have no idea, almost from circumstance. There is this lady with 2 babies which is cool and I was gonna lay down and watch one of them. But I feel something in my food and It starts oozing puss from a. Wound, and then it gets worse and its like peeling marrow from bone. My whole toss came off, ad peeled it off. My dead is there, trying to be supportive. But I can feel it and think, today never happened. Also there is a hella storm coming with crazy sounds."},{"date":"2013-01-17","dream":"I am with these kids and we gave been taken to this school. its like a boarding school of sorts. There is a headmaster that seems evil like you would expect and they are now herding us onto busses gonna take us somewhere and do who knows what but not anything good. Me and a couple guys make a run for it, we hop into this van or truck and take off down the main road to the gate exit. WE are thinking by the time we get there we wont be able to open it, and i tell them to just blast through it. There are a bunch of cowboy players charging us, theyd are like the guards….we keep going and they all scatter. We make it and we are on the road. Then we try to figure where to go and know we cant go home cause they will be looking for us, as we drive on down the open road."},{"date":"2013-01-20","dream":"I remember Im with Donny. I am in town and I have money and a car. We need to go pick up Sam or drop him off at his car or something, not completely sure. Im with Donny in his room. He has bunk beds. He asks if I wanna play a game of cards. We have a bit of time. I me film something about counting cards and hes like ya if ya wanna go to prison, and then says that its done with a special deck that u make. I agree with him like I used to, not knowing any better, negating my previous thought. I think he also did something cool with the cards as well, cant remember.There is this other image of my tarot cards. They were under Seth a table and I needed to pick them up before I left, wherever I was. Not sure where or when or if this actually was real but the cards in this previous dream reminds me of this. Not sure if thats completely how the past was but."},{"date":"2013-01-22","dream":"I am taking a flight that day, and realize i have very little time to get to the airport. I am relying on others for a ride though, so i think i may be late. I am at my Maw Maws house with chris and her, and i ask one of them what time my flight leaves but its not for a while. I go and pack some things up. I think about taking my guitar amp but i dont, but maybe i could get it sent to me. There is some other stuff i grab too, cant remember. The room though is harrys room, chris and Is old room. Ariel and Maiana are also there. Ariel was gonna take me to the airport, but then she says shes waiting on her friend to call and hangout, and since he was the only one of us to get her a christmas present he gets priority. Kinda like shes pissed. Whatever though. Chris and i have to go grab this van/truck of maw maws. She asks if he made the dent on the side and Im not sure what he says but he says he noticed a crack on the windshield with blood. We go pick up the van and i remember that we had done this earlier and he followed or maw maw followed us while we made it home. It doesnt have any license or registration so its kinda dangerous. Also there are a couple of guns that we shouldnt have either. i notice the crack and blood and the window is a little foggy. Chris tells me that we are supposed to have 3 backroad routes. I pull out of the parking lot, nervous for some reason, probably the guns and no license. When i cross the opposite lane of traffic, i barely make it past a semi. Then i realize it’s a one way street, i turn around and meet up with chris. I end up at this weird place, charlie is there, we are having to answer these questions or something and he asks to see this other guys shirt. Not sure why. The shirts and questions were different. more cars and transportation. People taking me. Driving others cars."},{"date":"2013-01-23","dream":"Movie about a kid who in the building during the Kennedy assassination but for another reason, Still top secret. Escapes with this family in the basement. They take him under their wing with a place to stay. He befriends talks about going to college, they witness a building demolished which brings up 911. Wife has the hots for him, kid is super cute girl who is low like a sister. For some reason I am in a dorm wit tons of kid tons. These two black guys call me uncle Cody. Im gonna make records with them. Some girls think Im cute. I dont go to their school. Me and Roxie at science place with hologramsLiving with lil Wayne and spiders. My boi yelled at cause he let someone into another rappers room. Chillin with Ani and Kate. Ani making fun, I shower. Im in a crowd handing out flyers collecting money. Different."},{"date":"2013-01-22","dream":"I am at home at a table in the kitchen. its a round table and Ben, mark and i are sitting at it having a great time. Sonia comes to me and its like i understood this great honest love that was there. it made the room so much better luke comes in and we decided we arent going to class which is awesome. Then we go down to the garage to the volvo. We are looking at it for some reason and in the dream it is mine. i dont know if we were leaving or what. I was also spinning around in this chair and going back in forth in it. i look at mark and am so happy to be there. It felt like family. I think it was mark, luke, ben and sonia.And then the Bufflm and the fairys came storming through the night. The bufflm always come with just majesty. Car again. this time it is mine. Not someone elsesRound Table. Perhaps the table i am building."},{"date":"2013-01-23","dream":"So Im on this trip, like a road trip with friends. tristan is there and some others, maybe tia is going i dont know who else. We end up in an austin type place. it always feels weird when Im with them. Nick brings up something weird about me and women or girlfriends or relationship i dont know. I wanted to talk to him about it, but it felt passive aggressive and he didnt say anything else. There were these musicians there. We were all hanging at this house, and eventually we are going to leave, we have to get on the road, mainly Im just hungry and dont want the shit food we were eating in that house. So Im trying to round everyone up. I got outside and these couple guys are playing a mars volta song. It was really good. Then i looked over and though i saw mykey, i go hey Mykey and it turns out its a girl, Im like whoops. I think we finally made it back to the car. I think some other things happened as.I find myself in this room. We have swords or knives, mine is kind of like a long chefs knife. We walk into this warehouse and we are looking for someone. There a re a lot of workers and as long as they dont see our knives its cool. Me and this other guy are sneaking around, looking for who we need to kill. There are three of us. One of them sneaks up on a worker about to kill him but i stop him. But then a lady sees one of our swords and we were caught. Her and another lady tell us to drop our weapons, and my friend has like a grenade launcher but tells them that there isnt one in the chamber. She doesnt believe him and neither do I. I can see that at the flip of a wrist he could take at least one of them out leaving room to take out the other by me or our friend. But for now its peaceful."},{"date":"2012-12-30","dream":"So at some point Batman switches minds. Bruce Wayne forgets he is Batman, and batman is running around, and not on the good side it seems, its weird. I am at Naropa isn, there is alike a huge conspiracy within. There are all of these brains that this evil brain guy has been fucking around with and is now dropping them all over the floor. It’s supposed to do something, i don’t know. Maybe just destroying them is enough. I keep getting caught and shot at, i can feel the bullets hitting me, but the just bravely sting. I remember running around Naropa board rooms, trying to get the hell out of this place, and i come into one room and they are pissed and tell me to get out. I tell them there is a weapon of mass destruction in the place, and they laugh, i tell them its brains. in on eo fate other rooms. i escape, into the courtyard, where this guy is shooting at me, his wife and mother show up next to him, i take the shot, and attack. I want to break his neck but i think i just kick his ass a lot. I grab his gun thingy that he was shooting at me with. Also another guy had come out and i told him to run and cheek out the room, so the guy with the gun hoots into the air spraying bullets on the building knowing there is glass ceilings.s I threaten everyone with the gun, it falls out of my hand, batman picks it up and sprays the spot on my arm that would deactivate the amnesia. I start laughing so hard, not knowing how all this is going to be explained but so happy now i know the truth and am once again the fully powered real batman. I am at high school, these guys are chasing me. There is this girl who wants to stay but Im trying to rescue. Finally i convince her and we are in my dads truck. And now in a car chase! I love it. i went home which was a mistake and heard people come in, I’m hoping its not them and Im hiding, thinking i should have gone to a friends house. What planet are Thom Yorke and Bjork from and what flower as well. It was a group of like 4 people i asked this to in the middle of a game. They asked all kinds of questions about the planet like if it was still there. IF they came here, or we went there and got them, but never got it."},{"date":"2013-01-29","dream":"Im in this hotel. There is this massive party it seems, or some kind of gathering. I run into charlie. He got a call from his dad, what seems like a telegraph. I then chase him down in this old elevator to the bottom floor. not sure why Im here, or if Im even supposed to be here. But the place is kinda like an airport mall type thing."},{"date":"2013-01-31","dream":"I am on a plane. My grandmother is driving or trying to fly. But i think something is wrong cause there is a part of the plane inside the plane and not out. it doesnt make sense and Im pretty sure this is why it wont take off. My grandmother gets out or something and i take control cause i notice we are about to go off road, i make a turn to sharp and wreck the plane. Then i am in the airport and lars and Charles are there. I am in this clothing shop and this guy is helping me pick out clothes. Its great as they have really nice stuff, i found a couple really cool feeling and fitting shirts. Then i ask lars and charles if they are going to the rainforest, as there is a flight down there. Charles laughs and is like ya! I do remember that when the guy is helping me he notices all these people lining up in the area Im in, i think he was getting frustrated but not with me. Someone also comes in and asks where the meat and potatoes are, meaning whitey Tighties. Me ben and a bunch of other pile into a van with this family to go to this festival carnival thing. Its in a huge park with all kinds of shit. Its’ weird. Weird cause we are getting into this van with strangers, is there enough room? and it seems totally fine."},{"date":"2013-01-09","dream":"Out to eat with Donny and a girl. There is so much tension between donny and I. There is this huge battle and we are trying to work out our past issues. He seems t one holding a lot of grudges against me for things that i did in the past. I apologize for what happened with Randi, and then hes like well u know whats up now ya? I say ya, i know he and her have been talking. He seems aggressive but calms down. Then i have my computer out and he has a smaller one. Makes sense, more portable and stuff, we seem to be cool, just so weird."},{"date":"2013-02-10","dream":"So there is this business place with this crazy lady working there. There are al these problems with her and it all comes to a head when she attacks everyone at work, and then she comes to the head table where this other badass lady is. The lady Calmly presents a piece of paper the crazy one signs it and the badass dials 777. These police kinda people come up in black cars to take her away. Then we are all outside of a what seems to be the first walmart i worked at. There is some bread that she had stashed and we are welcome too. She had been hiding out in a nearby town in her van. Its weird. I think susanna brings out an art piece that was hers or something, its pretty crazy looking but also cool. My parents are there and we get in the car i am in the passenger seat and see Luke riding by, i stick my tongue out at him. Then my phone vibrates and it tells me my voicemail box is full or something. I think he tried to leave a message. So Im trying to fool with it but its not working. Then i am watching this scene or am on this website, ya Im on this website because a message i had typed up didnt send. i think it was a paper of mine, and there were some characters that it needed to re download. I had used emoticons or something like that that that made more since than letters. so on this page was where i could re-download them and i was a bit pissed. The website though was a like science zoo website or something. I was looking at all the cool pictures and was toying with the idea of being some sort of scientist because i love nature in this sense and watching life forms in their natural environments. when we are still at walmart a mailman comes and slivers some mail. Two pieces were for mark, him trying to apply for something and something else. I think it was both naropa. I wanted to give them to him but i felt he might also not like that, him being so precious and all."},{"date":"2013-01-19","dream":"O my god so Im in this spaceship. Alone. With a dog. Im some kind of scientist i think. I actually dont really know war is going. But there is this one room i can go into and kinda shoot out into space. Exploring it in all its glory. Flying past stars and into boac holes and stuff. Its very strange. i am also wondering around this place, and i open a door and its this custodian guy or construction worker working. So its like this is a mock spaceship. I dunno. I go back inside, and continue to be there."},{"date":"2013-02-22","dream":"Its 6 in the morning and I am laying in a large tent. There are other people around me in the room. There is plenty of Room, its not like we are huddled in here. In fact there is an air condition in the tent. I feel comfortable and have my iPod in my ear, listening to yoshimi battles the pink robots, because the drugs have taken their toll. The tent moves shapes, the patterns on be roof swirl and collide. Everything is in flux. Nothing is still. Everything is moving. I walk out of the tent and notice the swirl of the grass, and the curve of the ground. I can notice the curve of the sky and the swirl of clouds and the curvature of the earth all seem to swirl like clockwork. Nothing stops, everything is moving. I can feel the rotation of the earth and I balance myself. Everything is moving. My thoughts are moving. I can see people moving and getting up for he morning. The clouds move, the birds sing and fly. Everything is moving, nothing stays the same. My mind tries to stick to one thought, to define a moment or an instant but it moves and changes with everything else. I cant define the present, for it becomes the past. Every molecule of me moves. Nothing the same as it just was a moment ago. Nothing can be defined for it limits what it is now and what it can become. All that is reliable is mystery and movement. I move to the shower and shower. I wash everything of me. I rearrange the atoms of my body with the heat of water and movement of my body. Nothing is the same, and nothing is stuck, so I can influence it how I want. I can change any bit of it. The sore on my body will pass. I know this, for everything does. To define it would demean it. For it to remain mystery allows it to move. Mystery can be allowed to change. It is given room to change. Solidity and definition lack freedom. They have a certain path and purpose. Mystery and chaos surrounds me, and encompasses me."},{"date":"2013-02-26","dream":"So i am in my old high school building. Not suer whats going on. but all kinds of people are there with me. They tell me to watch all our stuff. There is this group of people outside the door and for some reason i trade a few backpacks for some buffalo hides or blankets or something. I wasnt trying to make permanent trade or anything just for a bit. Then When everyone comes back i go outside and sneak the two backs back in. This black guy notices and is like hell naw! Hes pretty fit and shit so Im scared. Then the next day me and ben go over to their house and get somethings, i talk to the black guy and hes like, mani dont even care, Im not in charge of any of it. Hes like just take it. So i walk over and take it and thats it.I walk into the bathroom, and the door is open shower on and ben is peeing into the drain. I am looking for something. I tell him hes doing it wrong. And then i realize i wanted something in the kitchen. Some part of some dream where a dude is gonna kick me in the throat."},{"date":"2013-03-05","dream":"Weird dream. I wake up in tears from visiting my funeral. I get killed, by this girl. She runs this powder in my neck. I had been running from her and this other guy. I die and so do the girl and guy around me, but then we all rise up again and I realize I am dead and they are taking me to heaven. We pass Judy and I start to tear up and then we see my maw maw and I begin to really cry. We come into a sanctuary with all these old people, I cant really recognize any of them from behind. Its white in the room with I think a white casket. I wake up crying."},{"date":"2013-03-17","dream":"I am attending this yoga class with Nataraja. I am not sure where we are, but the room is one that is familiar but i cant quite place it. I think i was in the room for a sec, and then i left to d something, Im not sure what. When i was headed back i knew i was late and that they had started and i felt like Nataraja would be upset with me, but when i got in he had just barely started The yoga class proceeded very strangely and Nataraja seemed very close to me and it was a very fun class. We ended up having a good time and fooling around I think. I woke up feeling fun and rejuvenated, and wanted to tell people about the dream. I am still trying to place the room we were in. It was shaped strange and there was this kind of alter on the left when you walked in. It was also a yellow room."},{"date":"2013-03-18","dream":"I am at this Radiohead concert, a place where i have seen them before. I am with a couple people i dont know who. While the opening band is on i go to the mercy stand. I am looking at all the shirts, they are only 25 bucks so i wanna get two. I am worried that they wont have my size, but they say they do. There are so many cool designs, I am impressed. i check out a couple but want them to fit right. I also see some of the opening bands shirts. There are also so aqua teen shirts that are there from some other previous event. I got to watch Radiohead when they come on, the venue is very small and intimate. The stage is bare and there is another guy singing with Thom Yorke just hangie in in the back. i get the feeling they are testing out other new members, because i think Thom Yorke is quitting but the rest of the band wants to continue. I dont like the new guy, he doesnt fit at all. Then Im with my mom and sister in this town i dont know, kinda close to the coast i think, like LA. We are going to pay this weird lawyer some money to get dad out. reminds me of the lawyer from breaking bad. We go into this old store, like a thrift store for old people. we go up some stairs and at the end of the hall is the office. i am joking the whole time, and then we see angie, in this ugly green dress. It is old and she is trying to look fancy for some reason. My mom and sited know her i think. Then i am with Amanda on a couch as i wait for my mom. we talk and i i ask her about a flylo show and she tells me she saw it with her boyfriend and then thinks that i am upset and that i shouldnt have asked her that. I tell her i am cool and dont care really. Then we are at my uncle mangos house but it isnt his house. he is there and we are waiting for my aunt diana to show up. She is coming with my cousin Flying Lotus. She shows up first and there are mingo’s friends on the front lawn with her. Then Flylo shows up and i am trying to help him find parking in this horribly organized parking lot of my uncles. Reminds me of one Ive seen recently…cant remember. He parks in a spot i dont see and asks if Ive never done this before, i tell him no. i am giddy like when angelo would come as a kid. We are in the living room of this house, me on avouch sometimes with amanda. Fly lo shows us radiohead tickets, and i am like cool, maybe amanda will want to come too. Flylo makes sure he tells me that they arent free. Then he has all these like cardboard boxes that i think are games, and he wants to give them out to us. There are some other guys there too and a girl. He asks us who changed the name of the opening bands album to II with its new release. one guys answers one company i say Epic and then joke that we can just go through all the companies. and then Im like cause surely they didnt do it, o wait it was them wasnt it. Fly lo gives me the price and its one of their albums in awesome packaging. reminds me of Kid A limited but is bigger and all these things and pictures. There is this song called Milk and something on tone of the other albums that the people in the room are talking about. This cd is also 2 volumes. About two topics. at the end of the packing is this place where you can input your characters of a band, like who is the magician, the… the…. pretty cool idea. Then i think its over."},{"date":"2013-03-21","dream":"Drug dream with guy showing me his whole setup somewhere I dont know. Ben mark and I going to mall, wrecking car under construction I meet the drug peoples again with these chicks, new roomies all sleeping in same room. Something about them, one is like Laura"},{"date":"2013-04-11","dream":"I am batman once again, and someone is terrorizing everyone and killing them making it look like its me and my associates. There is poisonous gas and stuff. Weirdly i am also the villain and i rewrite the script a bit to make it better. I can remember me running really fast down the street and driving really fast. I also had a dream where i ran into Matt Pratt on the side of this dirt street. There was football tryouts right next door. I think i go over and try but maybe i dont make it or something. i wanted to play though, but couldnt and then realized it wouldnt fit in my schedule. I decide to create my own team i think."},{"date":"2013-04-12","dream":"Im at my parents house, actually next door where we used to life, though it has changed. i look outside and see all of this wildlife very strange creatures, perhaps a baby elk. But then I see this crazy looking dog and Im sure its a wolf. A wild wild wolf. And he has a pack of others. We are supposed to be going exit door but all these wolves see us and are barking. "},{"date":"2013-04-14","dream":"Dream I am at Alans house. I remember him telling me hes gonna take a...and he pauses and looks for me to answer. Hes looking for the right answer astronomy or astrology. Its astronomy I know. And I sense an interest in him. He questions me about it, and whether its a guess and test kinda thing. I explain to him that its not since its been tested and examined for thousands of years. He gets it."},{"date":"2013-04-18","dream":"I show up to this room. It has a weight lifting area and a teaching area and many other things. There is a girl there who I am here for. I have been here before. Reminds me of old youth group room. There is some foreign language class at one point. And Santi there doing clings on a machine. At the end we wait for the head lady to return. There is a weird wired bottle bong on the ground with dog shit it in it and greens. There is an über clogged pipe. She is playing death metal, I try to sit through. Then Techno is requested. I remember asking this one girl out. Then stop caring. Another points out that that is the next step, to not care, making them want it more. I have some party item on hold at a store that I realize I wont get, since its 1216 and they close at 1230. I decide ill get it later and we can trip in my room. I speak of this room as a school. My friend Ross I think drops me and a friend off and tells us he will be back and that we can use his house and there are kegs tapped. Also we can go to the bar close as they just tapped something interesting. Another dream riding around Corsicana."},{"date":"2013-04-30","dream":"I am at Amandas house hanging out talking to her. We seem to be getting along, but then I feel like maybe i should leave i have this feeling that it is open and neither of us is desiring anything, but also not saying no either. I go to leave, she acknowledges, but the energy leads us to her room, still talking and now on her bed. I almost say something, the fact that I am on her bed again, but she seems to be ok with it so i dont say anything. Alaya is there and we cuddle and then i move him over. Like a habit Amanda and I get under the covers. We both know what is happening, but I have doubts, though I still want to see what is going to happen. Perhaps it will be different i think. I get close and the first thing i become weary of is her smell, but its not bad. Then we kiss, slowly and gently, though as it increases I notice her teeth in the way, and they are sharp. I am not too into the kissing. At the moment i have this weird feeling. This feeling of shyness, i remember this from her. That was the feeling of kissing someone for the first time, this feeling of shyness and how do i kiss this person, can i kiss this person, is this going to be ok, i hope i am good etc etc. It goes through my mind as well. Judgment must be held off. Though there are those whom i kiss that is flawless, we just get it."},{"date":"2013-06-21","dream":"Weird pixelated dream with people chasing me wild wild eat style. I come across over the. Hill these 3 guys Im shown their made up badges and realize its like pat Garrett. I begin to run and run and get to a window hopefully I can jump out of. Slowly and pixelated."},{"date":"2013-03-03","dream":"Dream in a car outside of a house. Very conspiracy type. I felt a small tremor. Then we are in the car and feel a huge shake. I am scared and get out and can see that there is a pad underneath the car. Someone did this. I remember being in a movie or game like thing, in a parking garage, looking or running from someone I think...dammit shouldve written it down."},{"date":"2013-03-06","dream":"Dream with a chart and Jordan i think, at least the idea comes from him. It is a chart to close the gap between me and a woman, to see if a kiss is there. I then go and try it with a girl, at first i feel its not going to happen, but as the gap closes and i get closer, she kisses me."},{"date":"2013-04-18","dream":"Im hanging with Tyler the creator at my house. There is a guy outside who wants a cigarette one of Tylers friends. I tell him a dollar half joking, and he gives me some papers to roll. I do but am thinking about something else so its not the best then I take off. I am singing a kanye song and Tyler asks me if I saw the jayz kanye show recently. I told him no. He mentions kanye talking shit. We go inside, I have to grab stuff out of the car. Food and such and then I see this tiny dog come out too, but it wont come to me, and there is this girl thats tryin to grab it. I get Tyler and tell him. I think my cousin Chris is in the living room playing bass, but I kinda feel like its Tylers. I see penny and Sammy and hope they are all gonna get along. Remember the Angie food dream and senior seminar. I have to go to this class and am already late hut hungry. I go to this alley way food cafe and totally forget my food there, I think I ordered fish. I go back later and get it and while I wait I am eating this huge ham thats chillin. I say I want some chips with It and she gives it to me saying shes sorry people were mean last time about gay people. Im confused and slightly remember but also am thinking Im not gay so but free food and I take it and go. Outside for a family reunion thing. Mingo seems to be orchestrating and then all the men and the women with guitars and basses head to the middle, with their arms all rock starred out. Its so weird. Huge production, had to kinda sit with wanting to play but also just enjoying the production. And weird bombers or drones flying."},{"date":"2013-05-22","dream":"Its dark. Im at a pool with Angie. Shes in the car though and Im inside wanting to swim. In signing in and this black dude is giving me the runaround questioning me about all minds of things. I tell him Im in room 425 and then I see its. A group of girls. I tell him Im a friend. Hes suspicious but allows me to go after joining with his friend the other guard. I get down the hall into the changing room and realize I forgot my shorts. I walk about embarrassed but laughing and at first they are too but then hes like get we need to talk to you. I keep walking and get to the car, telling Angie to go, Hugh we are pretty calm. A car starts to follow ya with bite lights. Angie is confident we will get away, my phone rings bringing me into another dimension. The real one"},{"date":"2013-05-23","dream":"Im at some weird graduation thing . It didnt start out like this, at first it was me and Tyler I think and Anne and Charles and dark and others. Actually in the beginning it was Tyler earl me and some other dude. We were rapping on stage, very weird. Jumping around playing g around it was fun. Then it turned into this game thing. We handed out eggrolls for people to decorate and give back. There was coffee that I made for Anne. I remember his rope thing that was a race, in which I used as. A hammock. My parents in the audience talked about be silliness of graduation. I thought what else would we do?"},{"date":"2013-05-26","dream":"I am at Basta for this big dinner type thing. There is also this movie we may watch. Colleen and i are there, and we are drinking and eating, i havent drank much. Low and behold, Claude walks in. I dont notice him for a sec, and he says hit o someone across form me, not sure who, but the person does not give him the time of day really. Not hug no anything. then he comes to me, and tries to stick out his hand and i dont give it to him. Colleen has now given him the cold shoulder and we try to ignore him. We walk around and mingle and grab food cause it has arrived and its really good, family buffet style. The people start to notice this guy and i realize he is still here. He comes up to me when i have my plate, and tells me we are going to go eat outside. i say who, he says me and him. I tell him no Im not. Then Rick is there and realizes what is happening and tells me to keep it cool and do the whole arm around the back thing. I tell him that he has to stop coming around where i am and colleen is and that he needs to leave. I walk him to the door and he says something about allah, i say most high allah! He leave out the side door, and then I go back inside. People are trying to ask me what happened, i think colleen says it went bad, but it didnt, hes gone. Colleen, tells me she started her period, i make awoke about being proud of her. She says sh just started this study thing that gives her only 3 periods a year. I notice this stain on her mouth form the substance spray that she uses. She says she knows. Before we all eat we all join hands for prayer, Colleen lets go of mine at one point."},{"date":"2013-05-30","dream":"I am at this fair thing, probably boulder creek fair or something. i am in this bar with ben and jamie and someone else. I just arrive and order a beer and sit with them, I am hungry however and want to run and see if there is a pizza cart open. it is a cart from another dream long ago that ben and Luke and i worked at. I go outside and it isnt there but i wonder around these tables where there is other food. There are funnel cakes and chips and things. Then i get to some better tables with pasta and ribs and pizza. It is the table for volunteers, its free food1 I load up and head over, i want something else, and i grab a couple tortillas for 75 cents. Then i load up on mustard and make my way through the crowd. This girl rushes past me leaving her BF in distress. i get back into the bar, and Ben Jamie and I think matt have now eaten or are eating, burgers and such. The waitress comes up and i think Im gonna get in trouble for having outside food in but i quickly order a beer before she can say anything. Then she comes with tacos for Matt, and jamie says something about my food not looking that great. I say it was free and notice i am missing my pasta and tortillas, i hope i didnt drip them, for i am still hungry and may go get some more food."},{"date":"2013-06-24","dream":"I am at this strange house waiting for The flaming lips to play. I walk into this one room, i think ben and I, and the door is closed and no one is in there except the band playing some songs. I ask them why and they say they are practicing. Ok Makes sense. So i go into the other room. And that becomes a jam room with the worst instruments. Later the band has left and arrive again. I dont recognize any of them. We go outside to get ready for the show and set up the stage and stuff. This guy hands out this drink concoction which i drink, more and more of. Not sure what it is but it doesnt taste like drugs. Then wayne, or who is supposed to be wayne gets ready and is naked. He looks more like Seymour Hoffman, and does these weird backflips which was very impressive cause hes so fat. He puts clothes on to play. seems like a pre-show ritual. Mentioned earlier about all the people that he brought that drug dealers always happen to tag along."},{"date":"2013-07-07","dream":"I was hosting at Basta. It was strange didnt look like Basta. I was having to clean up things, there were two condoms on the wall that chef got pissed at me for. I said they werent mine but they were. The. This crazy guy came in and I had to get him out. It was scary but I did. I didnt sign up for this."},{"date":"2013-07-14","dream":"I am in this strange town, i cant really recognize it. I run into some friends, i think one of the Dylans is there and wes from Admissions. They tell me about a concert they are going to . i dont now the artist, bu they want me to go, but i dont really want to. So they leave and then hit me up, but i still dont want to go. Fast forward to what seems like the parking lot of the show. There is this homeless lady in the parking lot asking for things. She asks us a couple times, (Us as in i am with someone, a fatherish figure). The guy Im with gets stern, No like dont ask us again please. Next Im driving down the road in a truck with my dad and sister. We stop to get some gas at this gas station. I go inside to get some food or something, and they lady there asks me if i have seen this 14 year old girl. She asks me kind of accusingly. I tell her i have one in the back of my truck. She gets pissed and kinda wont let me leave, mad that Im joking about something so serious. we are outside and i tell her that Im not joking and show my sister. My dad says how he didnt like the town we are in, I agree that something is weird. i go back indie to pay for my whatever and am now hungry but they dont have any food in there except some old french fries and onion rings it looks like. i dont wanna go into their food place, and so i think it ends. The lady i wanted to pay with tells me to pay over there with another guy. They layout has changed in the room. Another dream at my house on 31st. I am in the house with a friend of mine, in fact i think Im actually working. the dude asks if i wanna share a beer, Ive already made him some food. I tell him ya, but then get sidetracked by something. he had also given a present to my father, so i went into his den, he was in there, with just a towel on, and i show him, i was gonna just put it on the table. Hes excited because it is a compact shaver thing, and then i ask him about one for me, which one i should get, i was remembering his norelcos. he give me advice, its a great interaction. I am then in the room with Brian and my dad and another, and tell them i am gonna clock out and have a beer and burger, they laugh and i go in to the kitchen with the guy, who has been eating and drinking. I join him for a bit."},{"date":"2013-07-15","dream":"First one I was with mom and dad"},{"date":"2013-07-28","dream":"Dreaming about having to go find my clothes for work. Outside of my house, the car has lost tires, and one destroyed. Devon is with me but she is also kinda Randi, and someone else.  She is not worried about it, but i am because i have to get to work later, and need to get some clothes before then. We finally get to a place, but it is small, the guy isnt helpful, he tells me about myself, that i have a strange face and that it wouldnt look good in a tie and something about having a cold voice. He also didnt have any good ties. I asked someone there where the best auto place was and they give me a name. There is also sausage on one of the racks in the room, that just got cooked off. I want to eat it but someone is there i feel like watching me.We go to another store with no luck. I cant even find a black belt. Not sure what Im going to do, I cleave one place and look for ho was with me but they are gone, something is happening. There is danger in the air not sure what is going on and cant find the car."},{"date":"2013-08-13","dream":"Not sure how this started. For some reason it seems like it started with a smoothie, or milk shake. Maybe not though. Anyways I was at this house with many floors, and it also had this little pool shaped thing at the base. I have become some kind of overlord of this place, kinda running a gang. Not sure how it started but it did. Im kind of just watching this as a movie, but have to play my part every now and then. There is this other guy who is kind of a leader too, but he ends up getting killed. There is lots of murder. We dont really give a fuck about anything. I think i kill my sister, or watch her die, and then she gets chopped up into vitas and put in a bag. Not sure if the orgy was part of it, but there is this huge orgy happening at a pool, and i see the girl Im with in the water, she is bleeding form her vagina. There is this whole feel of this dream that i cant quite explain. Unsettling, uneasy, like it cant last forever. Its short lived. Its disturbing as well. Well in the end, my step father shows up looking for my sister. He is integrating me, looking everywhere. Opening bags filled with bodies. There are other kids around too. A lady too, not sure if she is mine or not but it kind of feels like that. He asks me about her body, i say that i think the other guy took care of her, he asks where he is, i said that he is dead. He is relatively cool, but there is still this fear factor. Something about a gun as well…. Ends with us laying around i think, me him and some kids. I feel like Im losing their support. Perhaps am losing my clan the dream is over. Orgy at a swimming pool, my girl is there, getting fucked up."},{"date":"2013-08-24","dream":"I am in this house and Zach and Matt anyone are there maybe josh from Austin too. There is music being played and all of a sudden I dont have my guitar in my hand but I have a red Gibson SG. I like it and it has all the strings when my tele didnt, but I still ask the guy next to me where my tele is. It was a strange feeling of being judged and not just playing music but wanting my guitar. I immediately just wanted to go with the flow and play with the guitar I had been given. He feeling changed from that point on and we were on the grown next to this piano. Playing it and want an Xlr cable to hook up my Microkorg to it but then I realize I dont even have it. Zach does this thing with this headset handheld mic thing and pushed it in my face...its playful though.This reminds of me of this one night in Austin when Josh Matt Zach and this other kid were all playing music at Matts. Matt was on bass Zach on drums josh on guitar and this other kid on piano I thinks I was singing, howling making these amazing sounds. Or what I thought was amazing. We also watched the last waltz that night. And played with a projector attached to a video camera. This amazing feedback loop that made for such a cool effect. The problem came later when hanging out with nick and Ben and Joe and this guy. He was stoked to play music again, but was much more proficient than I was. Nick wanted me to play the piano, putting some effect on it, me having no control, I hated that. Then the guy assumed it was the drugs, that was why we aged so well that night....I also remember this guy from later on maybe weak or months later in a robe, kinda drugged out vibe. I mean he was good and he and Matt jammed but there was something I didnt like...something turned me off and away and made me feel really self conscious about making music. I am really hard on myself and always assume that the music I am making is not creative enough or sounds like something else and maybe thats why I need someone else yet to add to it or give me some kind of feedback. But Im so nervous and dont want to be wrecked by it. Uhhhh so Im stuck...I stay stuck. Never moving because I am afraid of it.Our house had set on fire, the one on 41st. I was running away from it I was down the block. Not sure what happened but it was a very strange feel. Not sure how the fire started but I didnt want to be near the catastrophe...so I was down the street and in this church parking lot or something...cant remember much more"},{"date":"2013-09-09","dream":"I am with Chris, not sure where, we are driving around a lot, i think maw maw is there with me too. Chris and I however are walking around this plaza, like a shopping plaza. We go to this comic book shop. Its pretty cool, they have all kinds of things, including video games and other nicknacks. There is an older guy that seems to own the place. I cant find any of the games i ant and cant even remember if i own a system. I notice also this japanese gameboy thing that i have never heard of, but i dont ask questions. I end up buying just some paper and something else, and strangely the paper gets delivered to me later in the day. There is something strange about the town too, like you arent supposed to drink the water or something, i dunno. we go to this other comic shop, chris is already in it when i show up, this is a real comic book shop, at least therere lots of books. I come in and its small and Im not even sure how to get in. I have this stuff in my hand too and dont want the guy to think Im stealing from him, so chris on the other side of the counter hands me a bag This gets the attention of the guy and he confronts us, didnt even recognize chris was in the store and wondering what we are doing. he gets real confrontational, but with a slight smile on his face, i hold me ground and he riddles me and its like he wants to fight, but Im not gonna, then he tells a joke about a girl not really being a blond but auburn/apricot hair and i laugh and everything is fine. i look around the store"},{"date":"2013-09-04","dream":"I am at this camp thing. The camp isnt in session but it is a childrens camp of sorts. Something happens and the guy that i am with who i think is a kind of leader sends this other guy away. I am taking him to his place to send him away and hes arguing knowing that hes gonna die. I put his head in the propeller and shave off some of his face, but then his face is ok…Yet Im pretty sure he still died. I go back and then we know that someone has died and that we are kind of wanted. We are looking for food too. We have figured out a way to get in to the buildings. And i go into one. There is remnants here of what we did, i think we painted over some blood or something. I go In the building and realize that someone has now puled up in this place. Shit they are going to find us. I climb into a closet leaving some others outside. I know there is food here. I am in the closet and want to find the food, want to get out but there is a girl in the room with her mother. There was also a radio on but i think i turned it off or did i. Cant remember what we are doing here"},{"date":"2013-09-15","dream":"Im in another town. With my family at a hotel. We go to the pool and lots of people are there. I run into Andy Krause first and he tells me they tried to take him to jail. Hes there with his mother I think and a girl. Then I are Jamie know lion by the drinks. I have a cocktail and a beer. My sister says its not a good idea and I said ya beer is a bad idea for me. She wants to go to this skating thing that if you brink 3 people you get free drink and skate tickets. I say maybe. I see Landon cool and chance kirks family. I shake Landons hand and he seems weird I didnt give him a hug. I think there is some kind of football thing going on. Then I sit with Jamie and cam and mention the skating thing. She is skeptical and talks about our brief talking/dating thing and I agree it was fun and she says sorry if she was going through things with her friend disintegrating or something referring to his suicide. I say no big deal at all we were all going through things. Then Devon calls to see if she can stay another night. And I feel weird cause shes on a date I think. "},{"date":"2013-09-19","dream":"Im in this room playing cards with this group of people. I think Leigh is there, and some others. We are trying to play with some if my tarot cards and then I remember I have a deck if playing cards In my bag. I got to get them. And then Leigh already has a deck I think, and I flash mine, surprised they are black with white print. This man in the corner of the table is ready to play some game and we play this strange game I cant recall. There were animals I think, it was a strange deck."},{"date":"2013-09-30","dream":"at first i am going to get these tickets for a show Im seeing. I feel like Im in austin or something like that. Charles and i are going to go to the show. So i go to the box office and sit my bike outside. It takes forever in side and some girl says my name. I barely remember her from high school but i say hey.  I remember earlier in the dream walking around and someone yelling my name from a car and then get a text from jamie evans. So when i finally get my ticket, after having to sort though unorganized cash in my pocket i go outside and my bike it gone. Its weird what is there and isnt. So i go to this building downtown where my friends are, waiting for charles, and we watch a storm come in , and then pick up like crazy. Alex cummins is there and before the storm hits I say that people dont make many weighty decisions and he says its all about asking the right questions. I say i wanna be asking the right questions and then the storm starts to come. When the lightning picks up real bad and the thunder too, we head inside but then i notice a tornado forming in the distance. i stop berto and show him and he is in awe. Then a tornado forms to the right like Ive never seen before. Reminds my of one of at the angels from evangelion, cause it was shaped like a tornado, but it was like ringed metal and not wind, Anwyays we get inside and i realize people arent trying to go downstairs and i recommend it and then go to grab mt shoes outside. But now the rain has kinda stopped and i hope i can get to the show. David banner was the show."},{"date":"2013-10-21","dream":"I am at my class reunion. Its weird. Some people I recognize, I kinda cling to Matt Pratt. Not sure whats going on maybe some games or something. I go outside and am hanging out there mark asks me to roll him a cigarette so I start to roll him this huge blunt type thing. I go over to their table and Ben is there awkwardly gonna Ty to give me a shake or something so I give him an elbow bump. and he tells me he was just with Devon but that she and Brian just took off together. I tell him I dont care, but I do, and I know it. I give mark the cigarette and hes playing some weird instrument that Ben warns is fragile."},{"date":"2013-10-20","dream":"Weird dream of Matt taking pictures and having one of Ambree and I naked in semi yabyum position. It was weird in the dream cause of what I thought others might think, but yet the picture was cool"},{"date":"2013-10-27","dream":"Im in this weird town, not sure where, i just got off work and am supposed to be meeting these guys at a bar, but they are late. They are older guys, like old guys but cool i guess. I leave looking for my friend, and go into the bar he was at but he isn’t there. Then i run into these two median guys, and they mention something about the bar I’m about to walk into, they say something about vatos then i walk in and realize the bar is pretty gangsta. I realize i shouldn’t be there and walk out, with my two new mexican friends. I climb a light post, then cop comes and tells us that that part of the street is gonna be mowed the next day i go back into the bar where my friend is supposed to be but he’s not there, but not more people are and they are dancing. I dance a sec, one of my friends does and i order an aperol spritz and talk to the bartender about it and he recommends an olive."},{"date":"2013-10-28","dream":"In part of the dream i am at this college campus, not sure why i am there, but i look at a table and there it Tim, Zach and Nate. They are young it seems, but they are going to be going to this college and tim does at the moment. Pretty weird.Later in the Dream i have made a turn down this road in my car going on a journey in the mountains and i notice i am at sliver lake church camp. I see kyle and all of these people form my past, josh motycka, and all sorts of people, and no one is happy to see me, except when i run into Mr cain and his son, I’m pretty sure thats who it was. They were great, and had a sense of humor about them so it was cool. Then I’m leaving and my dad is on his way. Saying that someone called him seeing me there. It was weird, and he gets his truck stuck and has to pull it out."},{"date":"2013-11-12","dream":"Im in this weird mall type place, its both indoor and outdoor, its strange, its a mall i know but I’ve never experienced it like this, like i didn’t know there was an inside. Im with some girls it seems, but i find myself in this shop with Shri Devi as the owner. I buy something, and I get change and then i still take 25 dollars from the change. I do it in a way that she sees me but doesn’t say anything about it, yet i know she knows and now i need to put it back somehow, but I’m not sure how how. I think in the dream of the ways i can do this, by buying something with my debit card and then placing the 25 under the slip, that could work, but then i realize its not "},{"date":"2013-11-30","dream":"i am kinda watching this story happen. This guy comes to this guys house and asks for a ride into town. The other guys asks if he was the guy from the convenient store and he says yes. They get in the truck and the driver has a shotgun and they drive to the convenient store, the opposite way of downtown, and ram this gate thing made of barbwire, stretching the wire til it breaks. Then I’m like in the back of the truck. Then on the top and the guy is trying to shoot me. He doesn’t ever shoot me though though definitely does shoot real bullets. I miss them or they miss me. We stop and get out and i get the gun and i keep trying to cock it and shoot and he just taunts me, every time. Then gets scared kinda saying its a life shot now. But it isn’t and i still can’t. Then i start hitting him with the gun. at one point i wondered if i should wake up, but i didn’t. He hangs from this tree and i keep hitting him, but he knows i can’t hurt him, and i hit him in the balls and it does nothing and i think he has no parts. Then i look inside the house and there is a sexy woman and i realize it was the dude from earlier wife. I get the idea to go in and rape her. I go in, he tries to stop me or slow down, and i go up behind her, she looks at me, doesn’t say anything or try to stop and i start to take off her pants. Im gonna rape her. and then this whole story starts happening. Im not sure if i should. Im not sure how the story goes, There is all this dialogue. it keeps changing as if I’m writing it. I think about raping her and then about him killing me at the same time, then there are four of us at a table and we are all gonna have sex, and angie is there and the other girl is courtney then sonia. Then i am watching angie bent over making out with the girl. and i am telling pizza nick the story as if it has already happened and i am just retelling.Next i am in the bed in my maw maws house. I am there alone i think at first then with a girl, a girl cousin. We are talking and get close and snuggle, and it almost feels sexual and i kinda have the feeling that we could have sex, but i don’t want to cause she’s my cousin and that would be bad, but also its still kinda dream. The lights are all off in the house for some reason, o ya cause its night time. I ask her how old she is and she tells me 19 and then talks about leaving the next day to go somewhere, i want to catch ride with her and chris to get something from my dad. they act like they have to do something else and it might not work. O well. i get up in the middle of the night to pee, and realize that its all clogged up and that maw maw had told harry that they would fix it tomorrow. i feel like my paw paw is alive too. I go ingot he kitchen and harry is there, and he talks to me. he talks to me about him paying rent and i start to be like o shit, i have been living here for 3 years and haven’t paid rent yet. He is like getting onto me. He can talk fine too. I start feeling bad for it and then i go back to bed and then there is a knock on the door and it closes and i hear harry talking to maw maw about it being my dad trying to get a little bit of money and bringing dads over i guess to try to do it. Very strange. There is also this crazy bat in the dream, while she is telling me about a bat that attacked her the day before and i start to tell her of bat sonar and how they create their world around them through sound. Another I am trying to cut my hair but my thing stops working so i ask my mom if she has one, and she does, but its weird cause my step dad has one too but i can’t use it or something. When she goes to cut my hair she its it way to short, actually bales it in the back. ridiculous. But in the dream it was bad anyways. I had super long hair in the back. I think i run into somebody later and get made fun of."},{"date":"2013-12-04","dream":"So I am in this weird warehouse school type thing. There are a group of people with me and its kind of a haunted story. We are in this one hall and we get these clues, this weird riddle about eyes and running and something else, maybe kids. So we kind of know what to do when the kids show up, cause there are kids. 2 of them and i think a third. They see u and their eyes light up and then they chase u, and you are supposed to run to some people so they can help u exorcise them. Well this happens to me. I am actually looking for he kids, and then i find them unexpectedly and they begin to chase me. Then I’m scared and i finally find everyone else, i think travis and angie are there, but they are all busy creating this thing, this weird alter with angie sitting on it. They don’t stop working but they do help me to exorcise the kids. Such a weird feeling too when i realize that it is self created, and when I’m free it seems so silly i was ever possessed at all.Also a dream i at Ria’s and Tim’s house. I am hanging with them talking to tim, but I’m really there because of someone else. I ant remember who it is, some other girl i am interested. Reminds me of caitlin but its not her. Anyways i am there about to go to bed talking to Ria and tim, looking around their room, talking tim something i can’t remember. He asks my age, i tell him 27 he tells me he’s 24. In the living room, i try to convince sneakily the girl to let me sleep in her room, cause the living room i s way to bright in the morning and people will be up. Don’t think it works cause a couch with blankets is set up."},{"date":"2013-12-09","dream":"i am at this party in this big house. Arlene lives here. I am picking her up or just hanging out I’m not sure. I get confronted by some lady and she tells me i can’t have my truck here, like its some other kind of party, or its private or something. So i leave and arlene is waiting in the car. So we take off and go somewhere else i feel like we are in alabama. She is drunk I’m pretty sure, and now we end up at basta. I am there at the chefs table and talking to everyone. Its chill, a lil darker than usual. Then alex musat comes in. he is trying to date her or something. Or is dating ghee. He is upset with her, and blah blah woof woof. Next thing i know I’m at some other house with some friends going o a party. This one guy there is saying something about wearing cellophane pants. When we show up no on e is wearing pants so i assume he wanted to go but wanted to wear pants, but still fit in. There is this door, calling in Roberto and some other peeps, for something i don’t know. Berto gets called but doesn’t come. He is still outside. This hot mexican chick tells the announcer to call him but this other name ‘Andrew something’ that he was called as a kid. He does and Roberto comes out."},{"date":"2013-12-12","dream":"So Im in this van and am under custody of my grandmother or something, and people are trying to take me back to my stepdad. Its very strange. I can see an apt that my grandmother supposedly lived. So I run and am being chased by cops. There is a narrator saying something like unless u have superior jumping skills as Im running down alleys and hopping fences with ease and so much fun. I hesitate on the last jump but to no damage. I land in this kinda backyard kinda junky and this guy yells, can ya get me some Japanese arugula(maybe not Japanese). So I go looking for it. This is my home away from home. This old guy takes care of me, I tend the garden learn from him, and I feel like he trains me sort of. In what I dont know but I bet thats how I got my jumping skills."},{"date":"2013-12-17","dream":"So val and probably eddy or john and i are looking at this new place to live. Its down in this basement area of this house. We go down, and it seems there are these other there people checking it tout too. Val has this motion to let them pass so we do. They go down and we follow them into this apt. Its like 3 rooms, its weird, its like the guy who is renting it lives here too, or right outside the room. Or maybe he’s moving out, don’t know the whole sitch. Anyways we go ingot his one room, and i check to see if we can be load, by banging on the ceiling. We hear this person immediately running down the stairs, and it is this beautiful brunette. She’s not pissed or anything, i think just thought we needed something. I am stoked and am like ’sold’! Then Val leaves for a bit and its very strange and I’m hanging with these guys, and the are threatening me or saying that we have wands and I’m like naw bra these are brooms…don’t know why we have brooms…but we do. They seem stumped and i go out to find val. He is talking to this chick or leaving the chicks apt, and something happens, cause there are like 3 of them, and they are hot and kinda all over us. I say something and they kinda leave and it is this push and pull, as val is like, you ruined it, but the push and pull continues. I end up going into their house and its huge and there are more people, more woman and guys. I start talking to this one chick, and I’m not sure what i am saying but it is working and she’s more and more into me. I say something and this guy on the other couch tells me I’m gay. I say naw bra thats how you get laid…Just remembered that earlier i had said out loud to val, dude lets have all the girls, and they all heard me. Yet when i went down there i buttered them up again. So i say to the kid naw thats how you get laid, and try to cover myself up and say that you have to mean it as well. I look at her and its all good, but i still have to go find val now. I go upstairs and there is a bunk bed and on top of it i think is val but its not. Its carrie and some dude. I recognize her she recognizes me she jumps on me we are all yelling and shit, and she’s like you were a goody goody boy, blah blah woof woof I’m like naw….then we are on the bed, trying to maintain talking, so that the guy she was with thinks we are talking, but actually we are exploring each others body…Then he peaks down, sees whats going on, her on top of me, and is kinda pissed. She gets off and I’m like dude, we were just so excited to see each other, its been years, you understand. He kinda rears for a punch, then doesn’t, then does, then doesn’t, then tries, but i can stop him it seems. just by focusing on the punch and not giving into it i can stop it. Eventually i grab his hands and we are kind of wrestling, but I’m not worried at all. Then I’m not me anymore but looking in and we are sweaty rubbing each other intimately. Next i am in basta, and George is there. We are supposed to be setting pu the restaurant i think, but all the lights are off. I think i masturbate in the restaurant but don’t realize it til bait later, and am like o shit, did i do that? What the fuck is happening. I kinda snap too and realize i am in basta, i might lose my job if George saw me and tells on me, and that i need to prepare the restaurant cause nothing has been done. i go turn on the lights, freaking our thinking its 5, but when i look at a clock its only 406. I am relieved start putting down the chairs and george is cool with me"},{"date":"2013-03-09","dream":"Im somewhere at night and my mom and dad are thee and I have horns. Big spiral goat horns. I cant make my mom food and Im crying. I dont think I can make my mom food so I go to be bottom of the hill and cry. Josh is there and he does make my mom food. Im crying cause there are certain things Ill never be able to do. The guy across from me also has horns. My parents are meeting us both for the first time. He says he gets worried about somebody telling him a hot girl is near so he doesnt swing his head and hurt himself with his horns."},{"date":"2014-05-25","dream":"I am at this house i don’t know. I am in the military. I have taken this assignment classified. This guy comes to the door, and gets me alone. He’s here to kill me. I have failed and now i must die. I know it he knows it and he takes me to the restroom to prepare. We are getting everything ready that will clean the mess easier. He is going to shoot me in the head. we are getting ready. I am contemplating the sitch, looking at my life. then we get close and i am helping him with final stuff. There is stuff of my grandmothers in the bathroom, and as we are getting close i wonder if hes gonna ask me if i wanna say something. I m worried it might not kill me. There is a lot of coke in the dream too. i don’t want my parents and family to find out about that. I know in the end i will say i love my mom and i start to cry.At my parents house and they have all these furry ferret looking things all around the living room cause i think i let them out and they have babies or something i dunno. Next i hear my dad pissed off about something, i think me and know he is coming after me so i grab a couple knives that are in reach."},{"date":"2014-05-30","dream":"Waterfall adventure with charles and gang. Snake scare but the rattlesnake isnt there. Then we find a hippo in the water, then we are chased by a mountain lion. But we are escaping when I awake."},{"date":"2014-10-27","dream":"Ben berry at my house. Being friendly. Telling me not to leave. Im looking for a shirt. Gonna go get food or something with him, mention needing to get a shirt. He Got a haircut inspires by me."},{"date":"2014-10-30","dream":"Piglet moat dream. Talked and said thank you. 2 cats "},{"date":"2014-11-04","dream":"football dream, late, dance move run elevator hotel, $5, dont know floor, little girl; exploring with harry"},{"date":"2015-01-08","dream":"Angie family dream. Wont take me home. Gonna miss bus. Mom and I singing fiona"},{"date":"2014-06-11","dream":"Driving in a car Pedro is driving i think. We are driving along talking when all of a sudden i notice that we aren’t on abroad but a shipping container and are about to drive off of it. I brace and we stoop just in time, with the front axels actually hanging off."},{"date":"2014-06-29","dream":"I pinch hit for this girl at a baseball game. We are at an old ballpark, like detroit or something. To get in you go downstairs like at the downer and through this gate. Well i get in and this girl needs a pinch hit and i do. But the plate is super crowded. And I keep asking them about it and they are like, from the corner and then I notice a dumpster behind me. But then I get situated and he starts pitching. I hit he ball 4-5 times all fouls just knocking the ball. I am starting to become more lucid and ready to hit it but the stick I am holding is a pool cue, I notice it at the last pitch, cause I nicked t with the end of the stick. Now Im holding the stick but the fat is in my hand. I hit the ball and get a base hit, pretty sure the guy tried to throw the ball at me. So the girl comes and takes my place and I head to the duck outish area. Then I see her and Angie coming back from somewhere and Angie is fucked up. I can see her salivating and crying and hiding. I ask her what happened and they said they were smoking. I said what and see Angie super upset and grab her and hug her. She gets better and wants to go up to the street for some reason. I go with her. And now Im up here and its night time in a dangerous neighborhood. But i know how to get them away from me or keep them away, but they are possessed. Some of them i scream at and some need to be exorcized, like this one guy, so i do that for him, its very strange i just wing it and get it out, but at first i don’t. Then i think i meet up with angie or someone like her and we are looking for something, a remnant of a dead aunt or something. We are next to this house and the alarm or whatever tracker we have on us goes off. I think maybe we should kiss or something, and we do and its awesome, but that’s not it. Then this thing slides behind us. and we notice its this ladies whole room, all of her books and everything. we found it. so we get in there and start looking at things, and the room, and i realize in the dream that i had been having dreams about a place like this, with the couch setup and everything. Then the girl I’m with finds this little map or something, and its a puzzle that has to be done in the room, the lady had laid it out perfectly to a grid to figure something out. So we place the books back like we found them and begin the puzzle.On this journey with angie to find something…find the room and the map or game or thing"},{"date":"2014-08-13","dream":"At some kind of event. There is this huge string. I have a bet or something that I can play it or make it really loud. Im up on a stage and it is slung up and I grab it and am supposed to pluck it. I do but it doesnt make any sound. So I go and get a mic. Pissed that val has mine. I ask Ben. He tells me where one is. This girl lets me borrow hers though, since all the pieces arent available and there is his Lego man too that I remember from Andrews keys. I think she is from huckleberry. Angite is with Ben in the other room. Im a bit jealous but am so stoked about playing this string and hope it impresses and is loud. But I think I wake up.Also Titanic Dream. aim starring and watching the movie. the scene at the top of the boat as its going under.. I remember the cold water as we plunge. So intense."},{"date":"2014-08-15","dream":"I am in Locale with someone, I’m not sure who. Kinda like josh but also my cousin chris. Anyways the owner comes up to us, and he isn’t the actual owner but like an actor of the owner for the dream. He is questioning the person i am with about pizza, and about the oven, and i guess has heard we have been talking shit about his pizza. He brings one over and talks about it, asking about he crust, i jump in and talk about the pizza too and have one of my own there. And am pointing out the crust. Even that i took mine out a bit too early, but that the little brown spots would be black, and thats what we want. He seems cool about it. Then some dude brings us a plate of cheese and olives, but its such a huge round plate. Then the boss man comes and sits with us, he’s super cool and chill in with us, someone says something and I jokingly am like, i know the owner and am laughing he thinks I’m making fun and asks what i say and i repeat and he sits next to me. Then when i am getting ready to leave i realize i have this loaf of bread and break it open and take a bite, and its fucking delicious! I am using a table next to these guys and am like, o sorry guys. and one of them tells me to take it home and I’m like hell ya I’m gonna. He speaks of bratwurst i say hell ya i got one. Then i go to the bar to wait for my friend and sit down. This dude is next to me and starts talking about waiting for traffic in boulder and something else. is carrying a purse which i assume is a lady friends. The bartender in front of us tries to blindly pour some coke into the mans glass and completely misses. Strange.Next Im in walmart with chris. I am in the electronic aisle and see this new album out and it is in this weird cigarette packaging.with e cigarettes, thats how each song is packaged. its strange and awesome at the same time. I wanna buy it just cause, but its 50 bucks so i don’t. i want to show chris. We go to the back room of this place and chris is showing my pawpaws van. its just a frame but he said they were keeping it here, its like the oldest van or something. It had a duck bill on the front too. Then chris is opening all these bags looking for something. Well one bag not all these bags. It seems like its paw paws stuff and he’s trying to find something. Im kinda worried we are gonna get caught but then again its our grandfathers belongings so, its gotta be cool. This lady comes by. She doesn’t want to go back to work so she chills with us for a second, hoping nobody sees her. Then some ladies come in from the back and she decides to go back to work.At a beach house kinda thing. Andrew and ross are there, from high school. There is one girl who seems like a friend and clipping her nails, asks for my bigger ones. Then there is the girl I’m kinda seeing, angie perhaps, and we are talking about this other chick that maybe andrew or ross hooked up with. Angie won’t tell me anything but the other girl is friendly which is nice. she says something but i don’t remember. just more friendly."},{"date":"2014-08-17","dream":"Im at this house party. Angies there. I hear someone come by looking for bacchanal angels or nymphs or something. I go into the room when i see Angie is in there. Its not her though(but it is) I am freaking out or something cause she won’t talk to me. Its weird though. She is providing space for me to have my little freak out, and not running away like get the fuck out. i do leave the room. Carole is out there and she asks what I’m going to do or something, and i say i don’t have a fucking clue, rather pissed off like. she kinda giggles and says they are going to Evan, meaning Eben G Fine. There is some kind of celebration going on and we are all going down there to celebrate. Kind of irish and magically pagan. Both animas allowed me to be angry or upset in the dream. Knew it was ok. I though carole would be pissed at me yelling but she wasn’t. I though Angie would be upset with me being all blah blah but she wasn’t. They both stayed, didn’t let it affect them, and didn’t flee either. Allowed space to be there, and my neurosis subsided."},{"date":"2014-08-18","dream":"Dream at some house. angie is there, this kid a mom and dad. Not sure relations, feels familial. Couple movie things going on. We are having fun, feels like a sleep over. I pick out most gigantic lying mouth of all time to watch and remember listening to thom yorke sing I know its over while figuring out how to put together a 3comp sink."},{"date":"2014-08-20","dream":"This was kind of a super hero dream. I remember being underwater being one character and there was this mermaid type character, like emma frost. Then i was up on land and could fly it was easy at first too. But then we got caught, iron man, i and someone else. a woman i think. We kinda lost our powers a bit. couldn’t fly but it was no big deal. Also nap time hanging with Karen telling her about co-dependent origin. She was stoked. Totally got it"},{"date":"2014-08-26","dream":"Watching two caterpillars face to face with another big butterfly behind them. It is messing with them for some reason and then all of a sudden realizes they are green caterpillars just like it. And then goes way leaving Ben alone to eventually turn into butterflies. The Us has been threatened with plane attacks. But the day coma and nothing happens. Then one day hector And the guys and I are outside some backyard and it begins. One plane crashes, close too, and then another. And they explode like fireworks in the distance. Andrew comes home, was pissed about something, Angie being scantly clad at a work event. But hes cool now. I also see isabelle or maybe it was kat I dunno. Later i am in a grocery store and hear people talking bout it but nothing new. I make he beginning of...some kind of bread maybe, and Im bringing it over to Donnys to make them breakfast. But its too early and they are all sleeping. So I go into some convenient store."},{"date":"2014-09-02","dream":"Corinthian. Coronos. Im watching this documentary about Im not sure his name. But its an artist and his work. They are talking about his sculpture and how he would look at a model in a way never looked before and create from there. I was super envious and wondered if I could have an eye like that it make art like that, alas its all a dream.In cart driver Angie works there. Leigh too I think. Its after a night if heavy drinking. Everyone is telling their stories. Stephen supposedly was shit housed with everyone. Leigh and I went out. Started at basta, or maybe thats where. Then we walked home, trying to get free shots along the way. Went to this dive that didnt. Let us drink but with a karaoke singer. Solo. She brought ya our coat we left to cart. Angie talks shit under her breath about her. I thought it was inappropriate. Especially as the lady hears it and Angie is like huh? What are u talking about...lady was a bit pissed, I get pissed at van stee for not making a pizza again and letting a guy wait for it. And Niemeyer wants me to create a crazy spreadsheet with trending algorithms. Makes sense in the steam and Im totally game to figure it out"},{"date":"2014-09-04","dream":"I am at this house with courtney. Also Wes is there. I think its Josh Motyckas house. His dad comes out. Gets mad at Wes for giving josh a tiny present, something that wasn’t good enough i guess. Then I’m with court at the same house and she is ready to leave, and i am too, and i am gonna go next door where angie is, its devons house but its not. I don’t feel like walking all around and see josh go through a gate to the backward, i go through and he says, you hangie out in there, or they allow u in there something like that.And i said ya and walk in. I was just on the phone with angie and she was telling me she was cold. I come in and she is jump roping. Sweating. Not Cold anymore obviously. She tells her trainer that is there, that she doesn’t like it when she screams. The trainer had asked if there was anything she wanted to change. Then angie goes and starts vacuuming with some other ladies. its weird.I am with angie and josh also at this other house. there is a piano. Josh and i play it and there are all of these effects. We eventually find this weird way to play it, it has a record function on it. Very strange but he’s leaning over me to the left and I’m playing behind him. Really weird. Josh goes to the bathroom or shower. Angies says she’s cold. I point at some blankets over there."},{"date":"2014-09-05","dream":"Im on pearl, having this wierd cookout. Im making this octopus in this huge pot. Ben and Luke are there but they are leaving town soon. Its night time. angie is there too. I remember her coming up to me and kissing me and Im blown away by it, looking to see if Ben has left yet, amazed she is showing this affection in public. Then these guys show up, blonde Kyle being one of them. angie says that Julia is with them and she goes. I try to go with her, but I have this fucking octopus. Doesnt work out, and I feel left out and needy. I see her hopping through the window and the whole door falls in on top of tons of people in the car. I go make sure she is ok, and she has escaped the car with a baby. I immediately think Ill of her that she escaped to not take blame, but she says she saved the babe. Ok makes sense. Then she gets in again. Door fixed. I yet again but some girl is like naw, u aint bringing the octopus, cause I had asked. So Im alone. And now realize my octopus is gone. I look around ask people, then find he pot and notice this guy gas grilled it. But its now a crab, not an octopus, it has pinchers and a shell. Jasper is there, i try to explain what happened with Ang. There is receptivity. Then I think about calling Molly, then I question that I do that every time Angie leaves"},{"date":"2014-09-07","dream":"I am outside of naropa with some friends at night. I think its lars and timothy eyes and maybe some others. We are just hanging not sure doing what, then we are in their house. I am planning on crashing there but nothing has been really said about it i guess. then it kinda gets time to go to bed and i find myself making my way to avouch. i think i eat some food with ales first, he has some salami or prosciutto. I have nuts in my bag which is great."},{"date":"2014-09-15","dream":"Redesigned basta dream. Huge car dog. Car dog commercial. New hot chicks at basta. Flour dumped on me. New cooks at basta. Looking for Angie, nowhere to be seen. Bout to check for her car. Message from Andrew, hes retiring have us all keys. Stephen made a pizza"},{"date":"2014-09-17","dream":"Angie and i are leaving some restaurant i think, and traveling through all these corridors to get out of wherever it is. Its kinda taking forever and are talking along the way. WE get outside to this parking lot, and there is this black guy next to a car, and then 3 other people in the distance at a car. We walk past and he grabs my leg, I’m on the ground, and he tells me to give him my wallet and not move. I quickly am like shit, what do i do? I think i turn to angie for advice and realize, naw i gotta figure this out. So i hesitate, don’t give him anything. Then i try to resist and he says he has a gun, but i think he’s lying. So i imagine what i could do, to hit him in the balls or something, or fight him and get away. I question the people that are watching this.I replay moments in my head as i awake, how to get out of the situation. It is like training."},{"date":"2014-09-18","dream":"In the living room with my mom stepdad mike and Dixie. I am drinking a beer. Dixie calls someone gay. Multiple times. Mike is gay and says something. I chime in and go on a rant about how it perpetuates a negative connotation toward homosexuals and everyone is a bit uneasy, though they know Im speaking the truth. I realized at the end as I say homosexuality isnt wrong, that I have hit a barrier. That belief isnt completely held true here. Dad says something about me being loud. And I say ya well you have to be loud for certain things like a man and millions others marching in dc. And sorry for being so in the room. And mike started it. So mike and I kinda pound, and my mom says something about finishing my wine hinting drunk. I put be beer on be table saying o dont need this. Then get up, and my dad is up And tries to cheer me with another beer as a weird peace offering and I got pissed he was about to drink. Chase him into the back where he is about to smoke. Offers me some. I dont smoke. Kind of a fight with a smashed glass of wine. It ends I think...actually I think the glass breaks first. Then the cheats. Then the weed and its over.So its night and Im near this water and there are these people searching for something. Looks suspicious I am with the birkholtz. Then the people talk to us about what they are looking for and this guy just wants some planner or phone or something cause hes leaving on Friday. So I want to help him. So Im looking. Not visible but there is a grace its under this piece of earth cause the water flows there too. I ask if here is a way under, Aaron is like ya, so we try to figure that out or are about to. Then I go outside and see this girl who I had seen earlier. She keeps smiling at me. I get close to get something, and she is like u want a hug and Im like naw this other thing over here. Then we are talking about going into the grotto and they are like fuck that there is a hawk in there. Then Im like Imma ride in there on my tomahawk. Tomahawk vs hawk is said and then I leave. "},{"date":"2014-09-19","dream":"Baby dream. With the crew I think, but dont recognize anyone. In fact they are more my family. Angie is there taking care of a kid. Its a lil man. So small but totally ready. This one dude and I are alone and he wants to "},{"date":"2014-09-26","dream":"Walking back to cart I begin to get scared. I am running kind of and can see myself running weirdly with my arms like an ape. I think this is funny and tell myself, hmm I do this is in my dreams sometimes. I get to this achool and am going to cross the field and there are all these people there. I see some teachers and a cop, and Im still scared but slightly less. There are these people there though talking to these kids. Telling a story about what they are going through. They must be in prison or something. Then this voice is behind me in my head, telling me about a woman, that Ive killed. And I couldnt remember. But I knew it was true, yet no one knew about it. But they may find out. I got scared and woke up. Unsure."},{"date":"2014-10-26","dream":"at some party. my family is there. musicians are there. It actually all starts with leaving basta to go to the pool. i cut myself when angie and court and others go up there. Previously in the dream i remember seeing people jump from this balcony into pool. They were playing games. I guess i thought i was going to that. When i got to the top though, and the elevator was moving so fast, there was like a service going where the pool is, but then i hear voices, i go to one hot tub, then another id dint know existed. There is angie and court and a bunch of others i don’t know, and this one guy who angie is talking too, seemingly friendly, i am suspicious, watching, as she unmans his hair, but then he seems to be with this other chick, so i relax. Then angie is like I’mma smoke a cigarette, so gosh, and i and her go outside. I get jealous again, thinking they were trying to take this time alone. but i go out and there is another little hot tub, its all rocky and cute. Then these guys come outside, 2 bigger guys, they say they need to talk to angie alone, and ask us to go away for a sec. So one guys takes us aside. he’s cool talking about fighting say he could kick me in the head, but not threatening. i tell him he can’t. then he shows a semi roundhouse. I get it. Then i look over at angie, the guy is gone, she is kinda smiling though, but i can see deep in thought. Then i go over and the guy comes with us and then wants to talk to her. I go into the other room and play music with these people. Then this guy puts down a guitar and i ask if i can play. he says yes. Its hard in the dream, strange guitar, weird action. I play something simple…major chords..sounds cool but i don’t know where to go once I’ve started…then i leave and go to angie she is talking to my grandfather and grandmother. I ask her and am cuddly with her. she tells me he’s some loyal something or other…and thats when i awake"},{"date":"2014-11-02","dream":"In a room with people watching Beyoncé. But there was a party before. So many people i knew. Brett Kevin, Patrick, Tim Morris all in this lazy river. Had one outside my apt. Went down to swim in it and catch up with them cause I saw Patrick on TV. I catch up with them, its cool, look up at the camera, they say something. Find myself in the house watching something with everyone, Beyoncé I think. The sound is messed up so I go to adjust it. Arlene says, wow only you would have though to do that. Then there is this talk about a killer of cannibal and all of a sudden he shows up behind us all and a table of legs skinned, perhaps cooked. Its very strange, Im up close observing them. I dont think there is fear though"},{"date":"2014-11-07","dream":"I am in this touring boat or something. We are touring this area not sure where. Ben berry is with me I think. We are coming upon these ruins that I can feel are mine, they are rightfully my home, my temple, my palace. Lain with gold it is gorgeous and I will reclaim my throne. Afterwards we go to an aquarium, with some female Im not sure who. We go against my reservation about not liking the place. Upon entrance me and the lady actually get trapped in one room helping to replace the cages and stuff for the animal, for get what it was. When we leave we find Ben and perhaps someone else, waiting. The woman Im with says its been two hours. I completely disagree and say like an hour and half. Its a stupid argument I know and we agree it has been a while."},{"date":"2014-11-11","dream":"About to go into this restaurant, not sure who all is there but angie and i are. and some other peeps. WE are locking bikes and parking cars. The guy who runs the place, comes out and i think he is checking to see how many of there there are of us but he is going us parking permits. I am trying to lock my bike and talking to angie about something and get pissed and through my bike lock and she runs away. I feel stupid and realized i have scared her away yet again, as she attempted to get close. I end up breaking my bike lock, and just stet it next to others, gonna check it later. I go in , see angie, walk past her at the counter, talking about coffee, and go to the bathroom, see a picture that looks like my family, and start balling, so tired o this stupid pain, want it to be over with.Parties all night it seems, can’t remember who and where, but i think angie was there a lot as well as other people. Other women, can’t remember."},{"date":"2014-11-14","dream":"Sitting outside of likes house i think in the car maybe not, angie and i are there. i look up and see these planes shooting lasers at each other, as if there is some kind of air fight going on , i tell angie to pay attention and am not sure if she can see it because of not having her glasses. she sees it then we see them gather with other planes and there is a full scale war in the air. Then it all comes together and is revealed as an advertisement for a new Nintendo console.  Huge hologram. Angie and i then go to eat at this little store, and i think Shri is the owner. We eat and angie pays, and then i want to get some baba or humus to go. She says it will be expensive for the homem made stuff but i just want a small deli of it. She gets it and when she is away Angie and i are in the corner, we make out for a second, kinda fall on the ground, then she gets up and squirts on glass table top and i get up and insert a couple fingers in her causing her to roll her eyes in the back of her head, then shri comes back in and we kinda pretend we weren’t doing anything, but you can smell the sex in the air. She hands me the to go thing, but i want more chips."},{"date":"2014-11-15","dream":"I am at some house with Angie, Tim Morris and Josh. Angie Doest this playful thing putting a blanket over josh’s head and then is on top of him kissing his chest intimately. I leave and then realize its super early and start o head back, but then I’m like naw fuck that, I’m gonna have a lovely day. I run into this topless shirted girl making out with a guy, then i keep walking and there is this biker girl next to me"},{"date":"2014-11-17","dream":"I am at Maw maws house and am eating things in the living room, a huge biscuit type thing that I’m warming up but don’t do it enough. harry is there too.Then these four people come over to see chris. Two girls and two guys. Im hanging out in the living room eating and such. then they come back into the room, the girls. They are very hot, and i talk to andrew about that later in one of the rooms. They say something about the guys leading me to believe that they are gay. I start slithering in, making people laugh, saying things."},{"date":"2014-11-18","dream":"Little dream with a few friends. I guess i had a system cause i keep talking about playing video games all day. Mikey was there at one point and i almost got squashed in the garage door. Some neighbor too was weird about killing a rat. Then i am in my neighborhood in denver, kinda walk down one street and there are girls singing and a guitar man, i walk the other way, heading back home before i go to the store. Need to get some stupid little things i think. I live with andrew, i ask him if he needs anything. He doesn’t say anything i don’t think. I am about to leave when this cat is being cute, i call him sideburns and ask him if he wants milk. I don’t remember if he responds or not."},{"date":"2014-12-29","dream":"Out to eat, actually supposed two meeting someone somewhere. i think kate, or valarie. Kate actually it definitely is, and i went to a book store on the way cause i forgot Island and wanted to pick up another copy to read on the bus. Well i found another really awesome book, and then was looking for island under all these books but didn’t find. got on bus and when i reached my destination realized that i forgot the book i wanted to buy. neways i find myself at a kitchen type place, kelly and kyle are there, and I’m with chad. i see jordan walk in, and someone else later too. very strange. tell jordan i just saw kevin head and kenzi within the past two days. kelly and kyle wanna hang out and go to some party if we can find it, or just get dinner. sitting with chad this gay guy comes up that had knew and he tells me to ask him to move in. the guy comes up and kisses me, i tell him its sexual harassment. Then i leave..Something happens. This black guy does something to this other guy and i can’t remember what. But i do remember us being in a house and the black guy putting two guns to his mouth and blowing his brains out because the other guys friends have caught up with us. revenge type. angie calls and i awake."},{"date":"2015-01-25","dream":"Dream with my mother, my sister and I in my grandmothers old house. it has a modern house across the way. I am outside messing with this standup heater thing and it falls over, and to make sure it doesn’t blow or anything i unplug this part from it. but then i discover that it is leaking gas, or a flame and can hear a clicking knowing it is going to blow eventually if caught fire. I get a water hose and try to wet it, hopefully stopping it or delaying it. it begins to get red hot and i run inside and tell my mother and sister that we need to go. We need o leave. Then it blows up in the loudest noise. I then say we should leave my mother questioning if thats why, that I wanted us to run away. Yep i say. I have lost hearing in my left ear, or atleast it is still ringing and i wonder if i have lost it for good this time."},{"date":"2015-03-12","dream":"I arrive in Austin, Nick and Ben pick me up. They are a little hesitant to take me to their house, cause i haven’t asked or anything. Told them i was planning on staying with Donny but that he wasn’t answering. I had just figured out that i was coming the previous day.  So they figure it out and say i can stay at their place.  We get there and they joke about their housing being this little hay loft on the left, while there house was the barn house place on the right. Nice an spacious and i felt like i was in alabama. They also have some of their cartwright stuff out there so its like their shop.  Then i get a call from donny and i go there. Til now i was with chris. now i am with Randi.  We all set up on Donnys floor and are gonna play a drinking game.  There are cats i play with, that are biting at donnas bike strings.  He tells me about his film exploits, and i ask why he doesn’t just film cats. I think he has  age there, sasha.  I go pee and am closet his room. There i see a couple movies, they were mine, some old horror, i remember one, and am in it, the ending. These stupid monsters fighting and chasing me, and then this weird version of jason comes to save the day. He gets killed and some monsters from the depths send up this resurrected monster.  Then donny has to go to work Randi is gone and Sasha is outside. I get on  a different shirt and some deodorant, and go go get tacos. Sasha gets out of her car and says donny took off with the keys so, then he shows up with them, sys hell only be like 30 minutes. Then Bren and some other dude show up talking tacos, I’m like yes, no one is waiting for donny.  Sasha and i go get ready and she doesn’t really wanna go with bren cause he’s depressed. I say I’m just gonna make him laugh a lot.  We head out."},{"date":"2015-03-22","dream":"i go inside basta with court and this guy. She’s on  a kind of date. We are in this little patio part of the place. There is an announcer in the room announcing a birthday to this black guy in the corner, Everyone cheers. Then another birthday for this huge black guy. But he was wearing this pants tight, so his fat was all on his waist and legs not his upper body.  He gets on the mic and starts talking.  He’s form the area, felt like someone from high school or something. Then I get this tinge of fear and i head for the door. I think he might try to blow the place up. I make contact with this lady as i leave, she feels it too.  When I’m outside i see these two black guys who have just left. One is telling the other that he felt he just needed to leave, they had left too.  Then they see this guy through some nice shoes in a  tree, so one gets up there to get em. The guy who through them was a ways away on his bike but now turns around and climbs the tree on the other side. there is an altercation or going to be and i see myself running away, and this guy chasing me.  i can see this happening as i think it.  So i run back to basta, into the back, change clothes cause he might recognize that, and go outside, as i see him interrogating everyone inside, looking for me  I go out the back, over a  fence but not I’m trapped inside  barbed wire area, I go back in Basta as this mexican guy is talking shit.  I tap his from behind as he’s talking to my other self, and we take him down, then take turns beating him up, but he’s hardly feeling it, its gonna take a while, but I’m confident."},{"date":"2015-04-07","dream":"Dreaming i am in  car with an autopilot driving.  I get in the seat cause i realize it doesn’t know about construction and such.  We almost wreck but i get out of the mud/gravel spot we are in and get back on the road. Then Maddie is there, or she was there earlier, driving me to someplace"},{"date":"2015-04-17","dream":"I am in this lab kinda place, I’m helping out this “doctor” of sorts, and he is extracting disease or whatever in potent form from patients with diseases. i am there visiting or helping out. i end up getting splashed with the substance on my leg. It reacts quickly and come to find out i have gonorrhea. i need him to heal me and we are walking away from cart, i guess i was on break or something.  Thats when he tells and won’t give me a number of this doctor or healer or whatever. he tells me a little film will be on my forefinger and it is, and that anything i touch it will spread it. its horrible.  But eventually he gives me the number, he mentions jordan and he mentions me telling no one. as jordan comes up and tells me i need to make a pizza and he can’t find anyone else there.  i get back and they are closing up and ross and andy have already gotten their bags.  I walk inferno t of a an arms dealer table as wll out front.In another ream i am hanging out with caroline, we are at some house, and we have this cat we are talking about and it crossing a bridge and how long it will take for the cat to cross, and it was like month off something. then I’m talking to the cat, and its anna. and I’m like lets find out lets try to put u in the tub, she’s like naw lets wait til i get my fifth leg, i was like u have it, its your tail and then am researching that"},{"date":"2015-04-27","dream":"I am in what seems like union station or atlas what i think is, and i am trying to go somewhere on the bus, probably to boulder.  But i find myself not he wrong side of the place. I run into Karen and i talk to her and kind of follow her.  But turns out she isn’t going to the bus she is going to  movie because now there is a movie theatre inside of this place…I go to try to find the buses and realize its all train tracks and not buses so i think i leave cause by now i have missed my bus probably.  So I’m outside and know i need to get through all of these people who are actually zombies. this one gets real close to me and as a defense i decide to stick my hands in her pants and to try to make her come cause thats how you heal them…Also dreamt of austin and Nick and perhaps Ben.  Something involving music but i can’t be too sure."},{"date":"2015-05-05","dream":"Im driving on this road and go off of it I think to avoid hitting this big semi, I am driving off road and see in front of me what looks like water but I dont think its that deep until I get close and realize it could be a lake and then I drive straight into it. I have this thought that this could totally be a dream cause this happens all the time, but that thought is unimportant because I cant be sure, I use try to survive and get out of the car no matter what. I am underwater sinking, I start to roll the window down, preparing myself for the big deep breath and the swim up, not knowing how far down I am. There is fear and calm all at once. I roll the window down a lil bit and let water come in a bit and take a couple breaths to get the big one before I roll the window down"},{"date":"2015-07-30","dream":"Dream of politics with a bipartisan race, the republicans were fighting and were dissolving, creating one big partisan. People are talking about it. I see it one morning with someone, perhaps Carole"},{"date":"2016-04-27","dream":"Hanging with a friend and there is this dog i am sleeping with on the couch.  He likes me.We are waiting on kelly to eat some food , alan josh, and other gang. Kelly calls and is yelling at some people at the restaurant so he won’t be joining us so we should just get some food.  I see the restaurant though as FBC though…Which is strange. Almost seeing Kelly as kyle Wilson. At this renaissance fair thing and this woman is singing proudly this song. This guy tells her to only play this one thing over and over, that that is what she was hired for. She is no longer happy but the dos next to her thank the guy. "},{"date":"2016-05-26","dream":"I am playing a game kinda thing in which i am trying to make it across to this ledge and escape but must do it by jumping on swingy ladders. But im kinda jumping and falling down them then climbing up. Other people are there too. Eventually i hit the bottom and down there is a body. So i have died, but its just so easy to just climb back up. Im down there though and i walk around a corner and there is a like a shop. A woman approaches me from behind. She is beautiful and wants to do something with me. I go in the garage and see some motorcycles and want to go riding even though i dont know how to ride. The ones i approach are kids ones though and she goes to the nice one. So i guess we go ride.I am hanging with angie, maybe its after her therapy and my turn. She hasnt left the room. Tells carole to help me not be so mean or something. Then tells her she called her a bad name last time she saw her. And its awkward. And angie hasnt apologized, just acknowledged. Im trying to get her to leave and say that im paying for this and carole says no its our 15 minute break. She is on my side.Other dream in which i am with perhaps Rawley in a car and we are going to pick up chicken livers for cart. I have this four wheeler i am driving and having this experience that Im more aware and faster moving and learning to ride it. Better than a bulky car. Drive into this swampy woodland place. And turn a corner and im in deep woods with some strange men that seem dangerous. I turn around. And book it. They want to rob me or something. I book it and someone is coming down the road and i yell at him to help. He notices and starts fighting the guys so i can escape back to down. I drive away and think i may be going the wrong way. I keep going and then up a hill that other four wheelers are going up but barely making it. At the top its a drop off, so steep. I am terrified and know i am not ready for it. So i go back the other way. "},{"date":"2017-09-03","dream":"Im in school again. I have aced 3 courses but for some reason forgot to turn in or quit on of my classes and have a zero. My main professor/advisor is strangely understanding and willing to help. He is a heavy set man resembling coach richey. He and another woman are talking to me about my paper and how it was great but spelling errors everywhere. I notice its typing problems. And they mention about my parents being shitty. I day i didnt have a computer til high school and they sympathize. I tell them i write perfect in actual writing. He gives me a huge hug, after she says something about me having horrible parents. A big hug from behind im hard to accept because im in tears having both male and female accepting of me and my past. I wake up crying"},{"date":"2017-04-28","dream":"Its a game. A godzilla like creature has been awakened and now we must find a solution. We solve  puzzle to find the dolls of the creature that can defeat him. There are 2 of them and we take them back to defeat."},{"date":"2017-04-27","dream":"How did he die? They ask. I know the answer. They know I’m lying. But the problem is I don’t know if I did it. I just remember him dying. In front of me. I get to my car and hear the crickets. Leaving the place and a girl.  I think that she will worry and will talk to her when I do.  I like the feeling. Randi. love no longer unrequited. "},{"date":"2017-07-20","dream":"Im at some house. I dunno Which. But Kate is there. And we talk and get close for the first time in a long time. She’s happy i show up and know how to see her. We touch get intimate again. We are hanging talking, though part of me I’m not attracted to.  My dad is there and asks why I’m with her. What I’m doing. Why i don’t date, I tell him that he and my mom fucked me up enough as a kid to want t get in relationship. I have commitment problems. He says that he would be there to get through that too .  he doesn’t like kate. Also some band on tv who is supposed to be asap kid rocky is rapping on  a video. They have a line about linkin Park.  I wake up to a text from my dad about chester bennington’s suicide"},{"date":"2017-11-09","dream":"First dream is a game of tagish in a field of crop circles. I think george clooney and some other dude are the other players. Next im in austin and playing music with lauren bishop. She has this song and i am playing a part to it. She doesnt like that part and i kinda get upset. She tells me i play really well. I get shy. Later i hear some of her music and it is incredible! Next im in austin or denver or something with friends. With some friends i dont know. See a cute girl. She puts her arms around me as we walk into a room with others. I hold them. As i say hi to a couple i know i kiss her a few times. I go outside and my mom dad and sister are there. Im a lil drunk and nervous but also drunk. Dad and his parents walk away. Talk to my sister who wants to know about the girl i said hi to. She knows her but cant remember her name. I cant either. Rox or something Next im close to work? Somewhere near work or home. Gathering with some folks in my community. They have a bar, this hippy couple that likes to party. I have a pet monkey. I flirt with a girl with a boyfriend. Find a yoga studio that has sex classes and such. Leave. Tell matt about it. Find angie. Go to her room. She lays down in a g string. Says she just talked to erin and she said she has nothing left to learn from me. Also at some point i have a monkey in my room. Its my friends pet. In a cage. I let it out and it runs around. I like it. It kinda plays with cats. Gets out of my room. Now everyone knows. Cops come but its about people coming and going too much in our house"},{"date":"2017-12-22","dream":"Radiohead is there hanging out. I meet them. Have the number. They have something of mine I need to get back. They feel like Jeff paradise same vibe. There is also a war at foot. And it happens twice. Metal gear feeling. There is a bomb on its way. The guy has a payload. But Ive seen it before. Seen how it happened last. Just hope it does this time too. Replaying life. There is a music scene too. Playing Korg and akai. Caroline and I at the end both aware of the time travel talking about how we cant talk about this. We are the only ones who know that time has changed. She is turning a corner and hits gravel and off the edge. Seems we will be ok but a loud blast wakes me. Perhaps something has changed. The war memories are intense. Even after the briefing as I head to barracks. All these almost skewers but they are weapons too. The barracks is so calm. So many people. Random recruits. Last run to town I bought a couple books and a smoothie? Interesting watching myself and being myself. Nice dream. Cc and I talking about time travel and hallucinogens. Im tripped out about the fact we did time travel, but I still cant pinpoint when or why"},{"date":"2017-12-23","dream":"My friend hector is telling his friend about me. We are in a store of sorts and he is asking me where he could find a copy of the bhagavad gita. We walk towards the area and converse about the importance of the gita. As we approach this one area we see a loose elephant trying to come in from outside. It breaks in through the glass doors. And is running around. We are running out of its path. Something tells me it will chase. But we are safe. Next i see the elephant laying down a person on it and i take a picture of it."},{"date":"2017-01-12","dream":"Weird game of thrones show being watched or played im not sure. Sometimes im in it sometimes not.  A part was unlocked with a pyramid, and everyone was pretty taken aback by it. That it was something rare, yet it was not completely uncovered. Towards the end I am now in the game and at my house with my sister and someone else. My father has had his wife taken away and can only get her back with a sacrifice. We have seen this on tv or something. Then he is coming up in the distance, but she isn’t there. He looks straight at me and has tongs.  He won’t take his eye off me and i know what he wants. He wants an eye. He just looks straight at my with determination in his eye, saying”One. One (Just one?)”  He is going to pluck out one of my eyes as a sacrifice to get his beloved back, and i am fighting him off when i awake."},{"date":"2018-02-19","dream":"There is this strange battle royal happening at this house.  All of these people i know and some that i don’t are fighting, kind of trying to get to the top of this building but a lot is happening outside on bannisters and railings.  I get to the point where I have this one guy to beat but i am pretty sure that i can’t.  I don’t face him head on but instead try to go around him. I touch the ground which should make me lose but it doesn’t i don’t think. i make it inside and she follows me in. My love. She is the goal.  So then we have a choice to go back into the void or reset or maybe they are the same thing. The rest of the night sleeping thats all i can think about. Is this reincarnation and resetting story of two lovers, trying and trying again to…i dunno. I have lost a lot of it, but it was kinda matrix, breaking out of programming, the cycle or loop of the program.."},{"date":"2018-03-21","dream":"I am living in a  house with family. We have neighbors  one of whom im attracted to or dating. The world is a bit weird and lots of end of the world talk.  Then a comet crashes.  The news reporter says that its just a  comet, very rare and that most people haven’t even seen one anyways.  Still sketch, Then im outside and a pencil shaped rocket crashes 5 feet from me head first in the ground. It has begun. Crashes start happening all over. Its terrifying cause all u can do is look up.  I go to the neighbors house to find the girl but they have turned hostile and protective with guns and now everyone is an enemy to them, I tell m family they are lost and we leave them.  Some ids run around with little gun things. Chaos ensues fast."},{"date":"2018-05-20","dream":"I am driving back from I’m not sure where in the mountains. I know Matt Calder is with me and not sure who else. I think he is driving. We are in the mountains and I look over at one of the other peaks and notice an avalanche starting to happen.  Me and 2 other guys in the car look and are pretty amazed. It gets bigger and bigger. I tell Matt to keep driving and stop looking cause well he wants to see also.  We continue to drive and then we actually get to the spot of the avalanche. It was on out path. We get to the exact spot and have to stop and wait for the landslide to stop falling. I am ready to just jump out  of the car when I notice that it might hit us. But it doesn’t. This one car gets completely covered but the guy is outside of it I think.  We drive bast the car, barely and the next turn is back into the city.  "},{"date":"2018-06-17","dream":"I am about to go to outer space. We know that high up but we are being launched. There is a fear and an excitement.  I dunno for what, nor who I am with but there is a newness to the city we are at. Maybe futuristic,. Definitely novel and I think clean? I am in a Classroom of sorts. studying.  But also in the water. Which is weird.  So I think I’m treading water this whole time, but then all of a sudden something happens. I go to the bottom and realize its not near where I thought it was, and that I have been underwater for a moment.  A while actually. I talk to the people around me and people have noticed but are trying to keep their cool as not to ruin the magic that we are all breathing underwater. And have been for a sec."},{"date":"2018-10-13","dream":"Gray and I are at my Maw Maws house in Alabama. We are getting ready to play music in the backroom. he’s playing that old white and black guitar. Not sure the amps we are using. Im playing an acoustic i think. He reaches for a pic. I don’t.  Sounds great. Im amazed at the tone that guitar has coming out of a nice amp. Its loud cause my grandparents have turned up the volume on the tv in shelving room. "},{"date":"2018-10-31","dream":"I am in this warehouse and I know that morning I have had a meeting with Kelly.  We talked about something that I’m not sure of.  Then I am hanging Paw Paw is there, alive."},{"date":"2018-12-04","dream":"I am driving somewhere in what feels like San Francisco.  I am driving I think Sarah's car.  I am driving and while I am going down the hills I try to break but I am not slowing down. I start to speed up fast and I cant see. I am scared I am going to go out of control and hit something. But as the blur happens I am still ok.  I decide to purt the car into its lowest gear and I slow down. Unharmed.  I put the car in park, and the next thing i remember I am not in the car. I am walking the streets and i remember there being a girl."}]